TestingHexThrombus/0/StrainRateMag

/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      StrainRateMag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
INLET
{
        type            fixedValue; 
        value           uniform 0;
}
OUTLET
{
        type            fixedValue; 
        value           uniform 0;
}
PATCH
{
        type            fixedValue; 
        value           uniform 0;
}
WALL
{
        type            fixedValue; 
        value           uniform 0;
}
}
