TestingHexThrombus/0/U

/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
INLET
{
        type            fixedValue; 
        value           uniform (0.000000 0.000000 0.100000);
}
OUTLET
{
       type            zeroGradient;
}
PATCH
{
        type            fixedValue; 
        value           uniform (0. 0. 0.);
}
WALL
{
        type            fixedValue; 
        value           uniform (0. 0. 0.);
}
}
