TestingHexThrombus/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.002 -0.002 -0.001)  //0  
    (0.002 -0.002 -0.001)  //1
    (0.002 0.002 -0.001)  //2 
    (-0.002 0.002 -0.001)  //3 
    (-0.002 -0.002 0.011)  //4 
    (0.002 -0.002 0.011)  //5 
    (0.002 0.002 0.011)  //6
    (-0.002 0.002 0.011)  //7 

);

blocks
(
    // inlet block
    hex (0 1 2 3  4 5 6 7) (40 40 120) simpleGrading (1 1 1)
);

edges
(
    );

patches
(
    patch Xmin   
    (
        (4 0 3 7)
    )
    patch Xmax
    (
        (5 1 2 6)
    )
    patch Ymin
    (
        (4 0 1 5)
    )
    patch Ymax
    (
        (7 3 2 6)
    )
    patch Zmin
    (
        (0 1 2 3)
    )
    patch Zmax
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //